# Everything Homebrew installs, in one place. `brew bundle` from this
# directory installs anything missing; setup.sh calls it for you.
#
# Adding a tool is a one-line edit here — no shell script to touch.
# `brew bundle cleanup` lists installed packages this file doesn't mention.

# ── shell ─────────────────────────────────────────
brew "starship"                  # prompt
brew "zsh-autosuggestions"       # ghosted suggestion from history
brew "zsh-syntax-highlighting"   # invalid commands turn red as you type

# ── navigation and search ─────────────────────────
brew "fzf"                       # Ctrl-R fuzzy history, Ctrl-T file picker
brew "zoxide"                    # `z` jumps to frecent directories
brew "ripgrep"                   # rg
brew "fd"                        # friendlier find
brew "eza"                       # ls with git status
brew "bat"                       # cat with syntax highlighting

# ── development ───────────────────────────────────
brew "git"
brew "git-delta"                 # renders git diffs
brew "gh"                        # GitHub CLI; git-pr and auth depend on it
brew "neovim"
brew "tmux"
brew "mise"                      # runtimes and CLI tools
brew "jq"                        # the formatter hook parses hook payloads with it

# ── apps ──────────────────────────────────────────
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"   # prompt and nvim icons need a Nerd Font
